# Problem Set 5

In [114]:
import sqlite3
import pandas as pd
import numpy as np
import seaborn as sns
import pdb

## Problem A: Writing queries
Make a connection to the baseball sqlite database and create a cursor object on the database.
Name the connection `conn` and the cursor `c`.

In [115]:
#IMPLEMENT ME (2 lines)

The following prints the names of all of the tables in the database.

In [116]:
c.execute("SELECT name FROM sqlite_master WHERE type='table'")
for name in c.fetchall():
    print(name[0])

Master
sqlite_sequence
Teams
TeamsFranchises
TeamsHalf
Batting
Pitching
Fielding
FieldingOF
Salaries
Managers
ManagersHalf
AllstarFull
AwardsPlayers
AwardsSharePlayers
AwardsManagers
AwardsShareManagers
HallOfFame
BattingPost
FieldingPost
PitchingPost
SeriesPost
Schools
SchoolsPlayers
xref_stats
Appearances

### Part 2
Print the column names for the Salaries table.

In [117]:
# IMPLEMENT ME; save column names as a list under 'names' to print
# Don't modify anything below.
print(names)

### Part 3
Print the first ten records in the Salaries table using `fetchmany`.

In [118]:
# IMPLEMENT ME; save first ten records as a list under 'recordsA' using fetchmany to print
# Don't modify anything below
for i in recordsA:
    print(i)

## Problem B: Grouping and Sorting
### Part 1
Write an execute statement on cursor `c` that selects the average salary tuples for 2010 grouped by teamID. You should pass year `y` into the statement as a variable for safety.

In [119]:
y = ('2010',)
# IMPLEMENT ME
recordsB1 = c.fetchall()
for r in recordsB1:
    print((r[0], r[1]))

### Part 2
Print the playerID and salary for the player with this highest salary in 2010. Make the year a variable in your execute statement.

In [120]:
# IMPLEMENT ME; save all records as a list under 'recordsB2' to print
# Don't modify anything below
for r in recordsB2:
    print((r[0], r[1]))

### Part 3
Print the teamID and total salary for each team in 2010. Sort by descending total salary. Make the year a variable in your execute statement.

In [121]:
# IMPLEMENT ME; save all records as a list under 'recordsB3' to print
# Don't modify anything below
for r in recordsB3:
    print((r[0], r[1]))

## Problem C: Using pandas to get the results of a query

### Part 1
1. Make a new connection to the baseball database.
2. Read the table names into a pandas data frame.
3. Read the Salaries table into a pandas data frame.
4. Using `head()` print the top records in the Salaries table.

In [122]:
# IMPLEMENT ME (4 lines including the line given below)

df_Salaries.head()

   yearID teamID lgID   playerID    salary
0    1980    TOR   AL  stiebda01   55000.0
1    1981    NYA   AL  jacksre01  588000.0
2    1981    TOR   AL  stiebda01   85000.0
3    1982    TOR   AL  stiebda01  250000.0
4    1983    TOR   AL  stiebda01  450000.0

### Part 2
1. Create a new data frame with only the 2010 salaries
2. Extract the tuple for the player with the highest salary in 2010.
3. Print the tuple.

In [123]:
# IMPLEMENT ME (2 lines); save the tuple under 'highest_salary_2010'
# Don't modify anything below
print(highest_salary_2010)

### Part 3
Use `groupby` and `agg` for extract the total salary grouped by team in the 2010 salary data frame. Print the head of the data frame.

In [124]:
# IMPLEMENT ME (2 lines); save the dataframe under 'df_groupby'

## Problem D: Joining tables in pandas

### Part 1
1. Import the Master table into a pandas dataframe. Show the head lines using `head`.

In [125]:
# IMPLEMENT ME

2. Import the Teams table into a pandas dataframe. Show the head lines using `head`.

In [ ]:
# IMPLEMENT ME

### Part 2
Using a left merge, combine the Salaries table with the Teams table on the teamID and yearID key retaining all of the records in Salaries.

In [ ]:
df_merge1 = # IMPLEMENT ME

### Part 3
Merge the previous data frame with the Master table on playerID retaining all of the salary rows. Show the head lines using `head`.

In [ ]:
df_merge2 = # IMPLEMENT ME
# IMPLEMENT ME; show the head lines

### Part 4
Print the head records with the following columns from the resulting data frame: first name, last name, team name, year, salary.

In [ ]:
# IMPLEMENT ME